# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 3 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
#anchors:
#  - [10, 13, 16, 30, 33, 23] # P3/8
#  - [30, 61, 62, 45, 59, 119] # P4/16
#  - [116, 90, 156, 198, 373, 326] # P5/32
#---修改后的anchors---#
anchors:
  - [4,5, 8,10, 22,18]   #  P2/4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
#    [
#      [ -1, 1, Conv, [ 64, 6, 2, 2 ] ], # 0-P1/2
#      [ -1, 1, Conv, [ 128, 3, 2 ] ], # 1-P2/4
#      [ -1, 3, C3, [ 128 ] ],
#      [ -1, 1, Conv, [ 256, 3, 2 ] ], # 3-P3/8
#      [ -1, 6, C3, [ 256 ] ],
#      [ -1, 1, Conv, [ 512, 3, 2 ] ], # 5-P4/16
#      [ -1, 9, C3, [ 512 ] ],
#      [ -1, 1, Conv, [ 1024, 3, 2 ] ], # 7-P5/32
#      [ -1, 3, C3, [ 1024 ] ],
#      [ -1, 1, SPPF, [ 1024, 5 ] ], # 9
#    ]
#
    [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

## YOLOv5 v6.0 head
#head: [
#    [-1, 1, Conv, [512, 1, 1]],
#    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
#    [[-1, 6], 1, Concat, [1]], # cat backbone P4
#    [-1, 3, C3, [512, False]], # 13
#
#    [-1, 1, Conv, [256, 1, 1]],
#    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
#    [[-1, 4], 1, Concat, [1]], # cat backbone P3
#    [-1, 3, C3, [256, False]], # 17 (P3/8-small)
#
#    [-1, 1, Conv, [256, 3, 2]],
#    [[-1, 14], 1, Concat, [1]], # cat head P4
#    [-1, 3, C3, [512, False]], # 20 (P4/16-medium)
#
#    [-1, 1, Conv, [512, 3, 2]],
#    [[-1, 10], 1, Concat, [1]], # cat head P5
#    [-1, 3, C3, [1024, False]], # 23 (P5/32-large)
#
#    [[17, 20, 23], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
#  ]
#---修改后的head部分---#
head:
#neck
  #[512，20，20]
  [[-1, 1, Conv, [512, 1, 1]],  #10  卷积层  [512，20，20]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #11  上采样 [512，40，40]
   [[-1, 6], 1, Concat, [1]],      #12 Concat [1024，40，40]

   [-1, 3, C3, [512, False]],      #13 C3  [512，40，40]
   [-1, 1, Conv, [256, 1, 1]],     #14  卷积层  [256，40，40]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #15  上采样 [256，80，80]
   [[-1, 4], 1, Concat, [1]], #16 Concat  [512，80，80]
   #[-1, 3, C3, [256, False]],  # 被删了

   #下面是我们自己加的
   [-1, 3, C3, [256, False]], #17  C3 [256，80，80]
   [-1, 1, Conv, [128, 1, 1]], #18  卷积层  [128，80，80]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   #19 上采样 [256，160，160]
   [[-1, 2], 1, Concat, [1]],  #20 Concat [512，160，160]

   #head
   [-1, 3, C3, [128, False]],  #21  C3 [128，160，160]
   [-1, 1, Conv, [128, 3, 2]], #22  卷积层  [128，80，80]
   [[-1, 18], 1, Concat, [1]], #23  Concat [512，160，160]
   [-1, 3, C3, [256, False]],  #24   C3  [256，160，160]
   [-1, 1, Conv, [256, 3, 2]],  #25  卷积层 [256，40，40]
   [[-1, 14], 1, Concat, [1]],  #26 Concat [512，160，160]

   [-1, 3, C3, [512, False]],  #27 C3  [512，40，40]
   [-1, 1, Conv, [512, 3, 2]], #28  卷积层 [512，20，20]
   [[-1, 10], 1, Concat, [1]],  #29  特征融合 [1024，20，20]
   [-1, 3, C3, [1024, False]],  #30 C3  [1027，20，20]

   [[21, 24, 27, 30], 1, Detect, [nc, anchors]],  # 将21, 24, 27, 30传入检测头
  ]
